export default class ProgrammStoreService {
    data = {
        product: [
            {
                id: 999,
                title: 'FHCTY',
                text: 'АРСЕН АРСЕН АРАСЕН ОАОВРФЖВЛФЫ' +
                    ' решения широкого спектра задач автоматизации управления и учета ' +
                    'и позволяет построить индивидуальную информационную систему, ' +
                    'учитывающую задачи и особенности каждого предприятия. ' +
                    'Подробнее о системе  По мере изменения требований бизнеса и ' +
                    'законодательства, прикладные решения гибко перенастраиваются'
            },
            {
                id: 1,
                title: '1C:Предприятие 8 для управления и учета',
                text: 'Система программ «1С:Предприятие 8» предназначена для' +
                    ' решения широкого спектра задач автоматизации управления и учета ' +
                    'и позволяет построить индивидуальную информационную систему, ' +
                    'учитывающую задачи и особенности каждого предприятия. ' +
                    'Подробнее о системе По мере изменения требований бизнеса и ' +
                    'законодательства, прикладные решения гибко перенастраиваются'
            }
            , {
                id: 2
                ,
                title: 'Отраслевые решения'
                ,
                text: 'Система программ «1С:Предприятие 8» предназначена для'
                    +
                    ' решения широкого спектра задач автоматизации управления и учета '
                    +
                    'и позволяет построить индивидуальную информационную систему, '
                    +
                    'учитывающую задачи и особенности каждого предприятия. '
                    +
                    'Подробнее о системе По мере изменения требований бизнеса и '
                    +
                    'законодательства, прикладные решения гибко перенастраиваются'
            }
            ,
            {
                id: 3,
                title:
                    'Отраслевые решения'
                ,
                text:
                    'Система программ «1С:Предприятие 8» предназначена для'
                    +
                    ' решения широкого спектра задач автоматизации управления и учета '
                    +
                    'и позволяет построить индивидуальную информационную систему, '
                    +
                    'учитывающую задачи и особенности каждого предприятия. '
                    +
                    'Подробнее о системе По мере изменения требований бизнеса и '
                    +
                    'законодательства, прикладные решения гибко перенастраиваются'
            }
            ,
            {
                id: 4,
                title:
                    'Отраслевые решения',
                text:
                    'Система программ «1С:Предприятие 8» предназначена для' +
                    ' решения широкого спектра задач автоматизации управления и учета ' +
                    'и позволяет построить индивидуальную информационную систему, ' +
                    'учитывающую задачи и особенности каждого предприятия. ' +
                    'Подробнее о системе По мере изменения требований бизнеса и ' +
                    'законодательства, прикладные решения гибко перенастраиваются'
            }
        ],
        services: [
            {
                id: 1,
                title: 'Консультации по выбору программного обеспечения'
            }, {
                id: 2,
                title: 'Доставка и установка'
            }, {
                id: 3,
                title: 'Настройка и внедрение'
            }, {
                id: 4,
                title: 'Сопровождение 1С (ИТС)'
            }, {
                id: 5,
                title: 'Обучение и сертификация'
            },
            {
                id: 6,
                title: 'Сервисы 1С'
            },
        ],
        table: {

            equipment: [
                {
                    name: ' CIPHER 1704 Black Лазерный линейный сканер 2D-ШК (считывающая головка Motorola) (без кабеля и блока питания)',
                    price: '22 770',
                    type: 'Лазерные'

                },
                {
                    name: 'CIPHER 1502 Black Лазерный линейный сканер (считывающая головка Motorola) (без кабеля и блока питания)',
                    price: ' 9 050',
                    type: 'Лазерные'
                },
                {
                    name: 'CIPHER 1000 USB Virtual COM Светодиодный контактный сканер  (в комплекте с кабелем)',
                    price: '3 130',
                    type: 'Светодиодные'
                },
                {
                    name: ' CIPHER 1000 USB HID Светодиодный контактный сканер  (в комплекте с кабелем)',
                    price: '2 830',
                    type: 'Светодиодные'
                },
                {
                    name: 'CIPHER 1000 RS232/ КВ Светодиодный контактный' +
                        ' сканер (в комплекте с кабелем)',
                    price: '2 830',
                    type: 'Светодиодные'
                },
                {
                    name: 'CIPHER 1504H KIT(для медицины) Сканер для 1D/2D' +
                        ' ШК (фото сенсор считывателя от Symbol SE4500L) сканирование ШК различной плотности (с бумаги, глянцевых поверхностей и мониторов компьютеров) (в комплекте с кабелем USB-HID+ автосенсорная подставка)'
                    , price: '21 550', type: 'Фото'
                },
                {
                    name: 'CIPHER 1560 KIT RS232 Светодиодный сканер, с' +
                        ' базой BlueTooth, в комплекте с кабелем',
                    price: '16 490',
                    type: 'Bluetooth'

                },
                {
                    name: 'CIPHER 1560 KIT KB Светодиодный сканер,  с базой BlueTooth,  в комплекте с кабелем',
                    price: '16 490',
                    type: 'Bluetooth'
                },
                {
                    name: 'CIPHER 1560 KIT USB HID +Virtual COM Светодиодный сканер,  с базой BlueTooth,  в комплекте с кабелем',
                    price: '16 490',
                    type: 'Bluetooth'


                }
            ]

        },
        experience: { items: [  {   company:'Автоматизация оперативного учета товаров на базе ПП «1С:Управление торговлей 8» у ИП Балаева Т.А.',
                client: 'ИП Балаев Т.А.',
                name: '1С:Управление торговлей',
                data: '12.09.2016 11:56:00',
                version:'8.3, сетевая',
                branch: 'Торговля'
            },
                {   company:'Автоматизация оперативного учета товаров на базе ПП «1С:Управление торговлей 8» у ИП Балаева Т.А.',
                    client: 'ИП Балаев Т.А.',
                    name: '1С:Управление торговлей',
                    data: '12.09.2016 11:56:00',
                    version:'8.3, сетевая',
                    branch: 'Торговля'
                },
                {   company:'Автоматизация оперативного учета товаров на базе ПП «1С:Управление торговлей 8» у ИП Балаева Т.А.',
                    client: 'ИП Балаев Т.А.',
                    name: '1С:Управление торговлей',
                    data: '12.09.2016 11:56:00',
                    version:'8.3, сетевая',
                    branch: 'Торговля'
                },
                {   company:'Автоматизация оперативного учета товаров на базе ПП «1С:Управление торговлей 8» у ИП Балаева Т.А.',
                    client: 'ИП Балаев Т.А.',
                    name: '1С:Управление торговлей',
                    data: '12.09.2016 11:56:00',
                    version:'8.3, сетевая',
                    branch: 'Торговля'
                },
                {   company:'Автоматизация оперативного учета товаров на базе ПП «1С:Управление торговлей 8» у ИП Балаева Т.А.',
                    client: 'ИП Балаев Т.А.',
                    name: '1С:Управление торговлей',
                    data: '12.09.2016 11:56:00',
                    version:'8.3, сетевая',
                    branch: 'Торговля'
                },]}
    }

    getProgram() {
        console.log('вызов getProgram')
        return new Promise((resolve) => {
            setTimeout(() => {
                resolve(this.data)
            }, 3000)
        })
    }
}